{
/* Passphrase panel titles */
"MESSAGE_AUTHENTICATION_TITLE" = "Viestin allekirjoitus";
"MESSAGE_DECRYPTION_PASSPHRASE_TITLE" = "Viestin salauksen purku";

/**/
"DECRYPTING" = "Puran salauksen...";
"ENCRYPTING" = "Salaan...";

/* <PGP> submenu title */
"PGP_MENU" = "OpenPGP";
/* <PGP Keys> submenu title */
"PGP_KEYS_MENU" = "OpenPGP-avaimet";

/* <PGP> submenu items */
"DECRYPT_MENU" = "Salauksen purku";
"AUTHENTICATE_MENU" = "Allekirjoitus";
"ENCRYPT_MENU" = "Salaa uusi viesti";
"SIGN_MENU" = "Allekirjoita uusi viesti";

/* Description of version prefixed with <Version:> */
"VERSION: %@" = "Versio: %@";

/* PGP preferences panel name */
"PGP_PREFERENCES" = "GPGMail";

/* Alert title and message */
"MSG_DECRYPTION_ALERT_TITLE_NOT_SIGNED" = "Viestin salauksen purku";
"DECRYPTED_MSG_NOT_SIGNED" = "Viesti on salattu, mutta ei allekirjoitettu. Sen alkuperää ei voida todentaa.";
"MSG_ENCRYPTION_ALERT_TITLE" = "PGP-salaus epäonnnistui";
"MSG_DECRYPTION_ALERT_TITLE" = "PGP-salauksen purku epäonnnistui";
"MSG_SIGNING_ALERT_TITLE" = "PGP-allekirjoitus epäonnnistui";
"UNSUPPORTED_ENCRYPTION_FORMAT" = "GPGMail ei pysty purkamaan tämän tyyppistä salausta.";
"DATA_NOT_AVAILABLE" = "Viestin sisältö ei ole saatavilla..";

/* Informational alert title and message */
"AUTHENTICATION_TITLE_OK" = "PGP-allekirjoitus";

/**/
"AUTHENTICATION_TITLE_FAILED" = "PGP-allekirjoitus epäonnnistui";
"TRY_AGAIN" = "Yritä uudelleen";
"CANCEL_DELIVERY" = "Kumoa";
"CANCEL_DECRYPTION" = "Kumoa";

/**/
"AUTHENTICATION_TITLE_UNSIGNED" = "PGP-allekirjoitus";
"UNSIGNED_PGP_MESSAGE" = "Tämä viesti ei ole PGP-allekirjoitettu.";

/* Toolbar item titles */
"DECRYPT_ITEM" = "Pura salaus";
"AUTHENTICATE_ITEM" = "Allekirjoita";
"MAKE_ENCRYPTED_ITEM" = "Salaa";
"MAKE_CLEAR_ITEM" = "Tee salaamaton";
"MAKE_UNSIGNED_ITEM" = "Tee allekirjoittamaton";
"MAKE_SIGNED_ITEM" = "Tee allekirjoitettu";
"ENCRYPTED_ITEM" = "Salattu";
"CLEAR_ITEM" = "Salaamaton";
"SIGNED_ITEM" = "Allekirjoitettu";
"UNSIGNED_ITEM" = "Allekirjoittamaton";

/* Toolbar item tooltips  */
"DECRYPT_ITEM_TOOLTIP" = "Pura viestin PGP-salaus";
"AUTHENTICATE_ITEM_TOOLTIP" = "Todenna PGP-allekirjoitettu viesti";
"MAKE_CLEAR_ITEM_TOOLTIP" = "Paina lähettääksesi viesti salaamattomana";
"MAKE_ENCRYPTED_ITEM_TOOLTIP" = "Paina käyttääksesi PGP-salausta";
"MAKE_UNSIGNED_ITEM_TOOLTIP" = "Paina lähettääksesi viesti ilman PGP-allekirjoitusta";
"MAKE_SIGNED_ITEM_TOOLTIP" = "Paina käyttääksesi PGP-allekirjoitusta";
"ENCRYPTED_ITEM_TOOLTIP" = "Viesti salataan; paina lähettääksesi viesti salaamattomana";
"CLEAR_ITEM_TOOLTIP" = "Viesti on salaamaton; paina käyttääksesi PGP-salausta";
"SIGNED_ITEM_TOOLTIP" = "Viesti PGP-allekirjoitetaan; paina lähettääksesi viesti ilman PGP-allekirjoitusta";
"UNSIGNED_ITEM_TOOLTIP" = "Viestillä ei ole PGP-allekirjoitusta; paina käyttääksesi PGP-allekirjoitusta";

/* Signature information */
"Bad policy!"  = "Epäkelpo vakuutus! "; // Followed by a list of policy URLs
"Policy: " = "Vakuutus: "; // Followed by a list of policy URLs
"Signed on %@" = "Allekirjoituspäivä %@"; // Param is a date, whose format is set by SIGNATURE_CREATION_DATE_FORMAT
"SIGNATURE_CREATION_DATE_FORMAT" = "%c"; // See NSCalendarDate documentation for format
"No signature creation date available" = "Allekirjoitusaikaa ei ole saatavilla";
"Key fingerprint: %@" = "Avaimen sormenjälki: %@";
"Key ID: 0x%@" = "Avaintunniste: 0x%@";
"No key fingerprint/ID available" = "Avaimen sormenjälkeä tai tunnistetta ei ole saatavilla";
"Validity: %@" = "Voimassaolo: %@"; // Param is the validity status string
"Signature expires on %@" = "Allekirjoitus vanhenee %@"; // Param is a date, whose format is set by SIGNATURE_EXPIRATION_DATE_FORMAT
"SIGNATURE_EXPIRATION_DATE_FORMAT" = "%x"; // See NSCalendarDate documentation for format
"Key expired on %@" = "Avain vanheni %@"; // Param is a date, whose format is set by KEY_EXPIRATION_DATE_FORMAT
"KEY_EXPIRATION_DATE_FORMAT" = "%x"; // See NSCalendarDate documentation for format
"Signed by %@." = "Allekirjoittaja: %@."; // Param is a userID
"Signature from %@ is bad!" = "Epäkelpo allekirjoitus käyttäjältä %@!"; // Param is a userID
"Signature is bad!" = "Epäkelpo allekirjoitus!";
"Signature status error." = "Allekirjoituksen tilassa virhe.";
"MISSING KEY %@." = "Puuttuva avain %@."; // Param is a key ID in hexadecimal
"Signature summary 0x%04x - Signature status %u." = "Tuntematon virhe: allekirjoituksen tiedot 0x%04x - allekirjoituksen tila %u."; // Generic error message; first param is a hex status flag value, second is a decimal status value
"EXCEPTION: %@" = "Sisäinen vierhe: %@"; // Generic error message; param is a string (exception reason, maybe not localized)
"AUTHENTICATING" = "Tarkistan PGP-allekirjoituksen...";
"UNTRUSTED RECIPIENTS" = "Ainakin yksi avaimista ei ole luotettu";

/* Title */
/* Error messages */
"GPGMAIL_CANNOT_WORK" = "GPGMail ei voi toimia, koska sen tarvitsemaa ohjelmaa ei saatu käynnistettyä. Yritä käynnistää Mail uudelleen ja jos virhe toistuu, lähetä viesti osoitteeseen gpgmail-devel@lists.gpgmail.org";
"GPGMAIL_CANNOT_WORK_HAS_GPG_%@_VERSION_%@_NEEDS_%@" = "GPGMail ei voi toimia. Se löysi GnuPG (%@) version %@, mutta tarvitaan ainakin versio %@. Lopeta Mail-ohjelma, asenna vaadittava GnuPG versio (esim MacGPG Group:lta, http://macgpg.sourceforge.net/), ja käynnistä tämän jälkeen Mail-ohjelma uudelleen."; // First arg is path to gpg, second and third are version strings
"GPGMAIL_CANNOT_WORK_MISSING_GPG_%@_VERSION_%@" = "GPGMail ei voi toimia. Se ei löytänyt GnuPG (%@). Tarvitaan ainakin versio %@. Lopeta Mail-ohjelma, asenna vaadittava GnuPG versio (esim MacGPG Group:lta, http://macgpg.sourceforge.net/), ja käynnistä tämän jälkeen Mail-ohjelma uudelleen."; // First arg is path to gpg, second is version string
"INVALID_GPGMAIL_VERSION" = "GPGMail-versiosi ei ole yhteensopiva Mail-ohjelman versiosi kanssa.."; /* Title of alert sheet */
"NEEDS_COMPATIBLE_BUNDLE_VERSION" = "Lataa ja asenna GPGMail-versio, joka vastaa käyttöjärjestelmäversiotasi. Löydät sen osoitteesta http://www.gpgmail.org/";

/* Validity */
"VALIDITY: " = "varmuus: ";
"Validity=0" = "tuntematon";
"Validity=1" = "määrittelemätön";
"Validity=2" = "ei koskaan";
"Validity=3" = "marginaalinen";
"Validity=4" = "täysi";
"Validity=5" = "täydellinen";

/* Generic MacGPGME error messages */
"GPGErrorCode=1" = "Yleinen virhe";
"GPGErrorCode=8" = "Epäkelpo allekirjoitus";
"GPGErrorCode=9" = "Puuttuu julkinen avain";
"GPGErrorCode=10" = "Tarkistussummavirhe";
"GPGErrorCode=11" = "Epäkelpo salauslause";
"GPGErrorCode=15" = "Epäkelpo suoja";
"GPGErrorCode=17" = "Puuttuu salainen avain";
"GPGErrorCode=31" = "Kelpaamaton salauslause";
"GPGErrorCode=40" = "Avainpalvelimen virhe";
"GPGErrorCode=53" = "Ei-käytettävä julkinen avain";
"GPGErrorCode=54" = "Ei-käytettävä salainen avain";
"GPGErrorCode=55" = "Kelpaamaton arvo";
"GPGErrorCode=58" = "Ei dataa";
"GPGErrorCode=69" = "Toteuttamaton";
"GPGErrorCode=84" = "Ei-tuettu algoritmi";
"GPGErrorCode=94" = "Avain mitätöity";
"GPGErrorCode=99" = "Kumottu";
"GPGErrorCode=107" = "Monimerkityksinen nimi";
"GPGErrorCode=116" = "Vakuutus ei täsmää";
"GPGErrorCode=125" = "Väärä avaimen käyttö";
"GPGErrorCode=150" = "Epäkelpo moottori";
"GPGErrorCode=151" = "Julkinen avain ei luotettu";
"GPGErrorCode=152" = "Salauksen purku epäonnistui";
"GPGErrorCode=153" = "Avain vanhentunut";
"GPGErrorCode=154" = "Allekirjoitus vanhentunut";
"GPGErrorCode=16383" = "EOF";

/* Signature attachment filename (suffixed automatically by .sig) */
"PGP_SIGNATURE_FILENAME" = "PGP";

/* Signature attachment content-description */
"This is a digitally signed message part" = "Tämä on digitaalisesti allekijoitettu viestin osa";

/* Version MIME part content description header */
"CONTENT_DESCRIPTION_HEADER" = "PGP/MIME versiotunnistus";

/* Encrypted attachment filename (suffixed automatically by .asc) */
"PGP_ENCRYPTED_FILENAME" = "PGP";

/* Encrypted attachment content-description */
"This is an encrypted message part" = "OpenPGP-koodattu viesti";

/* Multiple-part description */
"MULTIPART_ENCRYPTED_DESCRIPTION" = "Tämä on OpenPGP/MIME-koodattu viesti (RFC 2440 ja 3156)";
"MULTIPART_SIGNED_DESCRIPTION" = "Tämä on OpenPGP/MIME-allekirjoitettu viesti (RFC 2440 ja 3156)";

/* Tooltip for banner icons */
"SIGNATURE_IS_GOOD" = "Allekirjoitus on kunnossa; viestiä ei ole muokattu";
"SIGNATURE_IS_NOT_GOOD" = "Allekirjoitus ei ole kunnossa; viestiä on muokattu";

/* PGP Key Download panel */
"PGP_SEARCH_KEYS_MENUITEM" = "OpenPGP-avaimen etsintä";
"SEARCH" = "Etsi";
"CANCEL_SEARCH" = "Kumoa";
"SEARCHING" = "Etsin...";
"NO_MATCHING_KEYS" = "Vastaavaa ei löytynyt";
"FOUND_%d_KEYS" = "Löysin %d vastaavaa avainta";
"DOWNLOAD" = "Lataa";
"DOWNLOADING" = "Lataan...";
"DOWNLOADED" = "Latasin ja otin avaimet käyttöön";
"SEARCH_KEYS_ON_SERVER" = "Etsi PGP-avaimia avainpalvelimelta";
"DOWNLOAD_KEYS_FROM_SERVER" = "Lataa PGP-avaimet avainpalvelimelta";
"SEARCH_ERROR" = "Virhe etsinnässä";
"DOWNLOAD_ERROR" = "Virhe latauksesa";
" (%u bits)" = " (%u bittiä)";
", created on %@" = ", luotu %@";
", expires on %@" = ", vanhenee %@";
", expired on %@" = ", expired on %@";
"REVOKED_KEY - " = "Mitätöity - "; // Prefixes found key description, when necessary; followed by keyID, userID, etc.

/* Unmatched PGP keys for receipts - sheet */
"MISSING_KEYS: DOWNLOAD" = "Joillekin sähköpostiosoitteille ei löydy PGP-avainta. Etsi avaimia?"; // Title
"UNMATCHED_ADDRESSES: %@" = "Seuraaville sähköpostiosoitteille ei löydy PGP-avainta:\n%@"; // Message
"SEARCH_MATCHING_KEYS" = "Etsi"; // Default button
"SEND_IN_CLEAR" = "Lähetä selväkielisenä"; // button title; used in dialog after delivery failure due to missing public keys

"INVALID_HASH_%@" = "Hajaustusalgoritmi '%@' ei ole RFC3156:n mukainen.";
"GPGMAIL_VS_PGPMAIL" = "GPGMail ei voi toimia jos PGPmail ei ole asennettuna";
"GPGMAIL_%@_VS_PGPMAIL_%@" = "Molemmat laajennukset tekevät samaa asiaa eri toteutuksella, ja vain toinen voi olla asennettuna. Joudut poistamaan joko '%@':n tai '%@':n.";
"QUIT" = "Lopeta";
"CONTINUE_ANYWAY" = "Yritä jatkaa"; // Used as button title in modal sheet (PGPmail vs GPGMail)

/* Composer accessory view header, under To:, CC:, Subject: */
"PGP:" = "PGP:";

/* Key description in popups; prefixes key (actually, primary userID), when necessary; followed by keyID, userID, etc.*/
"REVOKED_KEY:" = "Mitätöity:";
"EXPIRED_KEY:" = "Vanhentunut:";
"DISABLED_KEY:" = "Poistettu käytöstä:";
"INVALID_KEY:" = "Virheellinen:";

/* UserID description in popups; prefixes userID, when necessary; followed by name, email, etc.*/
"REVOKED_USER_ID:" = "Mitätöity:";
"INVALID_USER_ID:" = "Virheellinen:";

/* GPGMail exception reasons */
"NO_VALID_PUBLIC_KEY" = "Voimassa olevaa julkista avainta ei löytynyt. Kaikki on joko vanhentuneita, käytöstä poistettuja tai mitätöityjä."; // Could be displayed after encryption
"NO_VALID_PRIVATE_KEY" = "Sopivaa henkilökohtaista avainta ei löytynyt. Joko mitään ei ollut valittuna tai valittu avain oli joko vanhentunut, käytöstä poistettu tai mitätöity."; // Could be displayed after encryption

/* Alert when user has no PGP key */
"NO PGP PRIVATE KEY - TITLE" = "Sinulla ei ole PGP-avainta. Et voi käyttää GPGMail:ia salaamaan tai allekirjoittamaan viestejä.";
"NO PGP PRIVATE KEY - MESSAGE" = "Jos haluat salata tai allekirjoittaa viestejä käyttäen PGP:tä, tarvitset henkilökohtaisen PGP-avaimen. Luodaksesi avaimen, lataa ja asenna MacGPG:n GPG Keychain Access. Löydät sen osoitteesta http://macgpg.sourceforge.net/";

/* Conflict resolution panel*/
"<ME>" = "Minä";
"<YES>" = "Kyllä";
"<NO>" = "Ei";
"<ALWAYS>" = "Aina";
"<NEVER>" = "Ei koskaan";
"<ACCEPTS>" = "Hyväksyy";

/* Additional info describing key */
"DISABLED_KEY_QUALIFIER" = "poistettu käytöstä";
"INVALID_KEY_QUALIFIER" = "virheellinen";
"REVOKED_KEY_QUALIFIER" = "mitätöity";
"EXPIRED_KEY_QUALIFIER" = "vanhentunut";
"CANNOT_ENCRYPT_KEY_QUALIFIER" = "cannot encrypt";
"CANNOT_SIGN_KEY_QUALIFIER" = "cannot sign";

/* Additional info describing userID */
"INVALID_USER_ID_QUALIFIER" = "virheellinen";
"REVOKED_USER_ID_QUALIFIER" = "mitätöity";

"COPY_MSG_URL_MENUITEM" = "Copy Message URL";
}
